module.exports = {
    // _开头是内部处理类型
    TYPE_DICT(t) {
        const arr = [
            '消息', //
            '_文本', //
            '_文本_长文本', //
            '_文本_戳一戳', //
            '_文本_未知动作', //
            '_文本_回复的消息', //
            '_文本_撤回', //

            '_混合图文', //

            '图片', //

            '文件', //
            '_文件_发送文件', //
            '_文件_收到文件', //

            '_卡片消息',

            '位置', //
            '分享', //

            '系统消息', //
            '_系统消息_钱提醒', //
            '_系统消息_成为好友', //
            '_系统消息_好友_黑名单开关', //

            '视频', //

            '语音', //
            '撤回', //
            '动作', //
            // '名片',
            // '视频',
            // '位置',
            '视频通话', //
            // '微信运动',
            // '位置共享',
            // '聊天记录',
            // '小程序',
            // '转账',
            // '红包',

            '自定义表情', //
            // '_自定义表情_微信买的表情',
            // '_自定义表情_非微信商店',

            '未知', //
        ];

        const f = arr.includes(t);
        if (!f) throw new Error(`未知的类型 ${t}`);

        return t;
    },
};
